/**
 * @author Болотин Максим Владимирович
 * @brief Messages for Лабораторная работа 10
 */

#include "index.hpp"

namespace lw10 {

	void message(const string& key) {
		if (key == "intro") {
			cout << R"(
Лабораторная работа №10

Задание:

```md
Вычислите и выведите на экран значения функции $$y = f(x)$$ в точках:

$$x_{0} = x_{\text{нач}}, x_{1} = x_{0} + h, x_{2} = x_{1} + h, … x_{N} = x_{\text{кон}}, \text{где } h = (x_{\text{кон}} - x_{\text{нач}})/N$$

Требования к программе:

 * Функция $$y = f(x)$$ зависит от параметра $$a$$;
 * Результаты вычислений следует оформить в виде таблицы, снабженной заголовком и вывести на экран; 
 * Задачу решить тремя различными способами (цикл с предусловием, цикл с постусловием, цикл с параметром). Все три решения оформить в одной программе, выбор способа предоставить пользователю;
 * Исходные данные ввести с клавиатуры;
 * Вид функции $$y = f(x)$$ и рабочий набор исходных данных приведены в таблице.

| № п\п | Вид функции $$y = f(x)$$                                     | $$N$$ | $$a$$ | $$x_{\text{нач}}$$ | $$x_{\text{кон}}$$ |
|-------|--------------------------------------------------------------|-------|-------|--------------------|--------------------|
| 1)    | $$\cos=\frac {\sqrt{x}+\sqrt{a}+1} {\sqrt{xa}}$$             | 12    | 3     | 2                  | 3                  |
| 2)    | $$\frac {\sin(ax)+\sin^2(a)} {4+\sin^2(x)}$$                 | 15    | 2     | 1.5                | 2.9                |
| 3)    | $$\frac {\sqrt[3]{a+x}+\sqrt[3]{a+2}} {a+x}$$                | 10    | 3     | 1.5                | 3.5                |
| 4)    | $$\ln{\frac {\lvert 2ax \rvert} {\lvert a-x \rvert}}$$       | 12    | 3     | 2                  | 3.5                |
| 5)    | $$\frac {1} {e^{ax}+2e^{a}}$$                                | 15    | 1.5   | 1                  | 2.5                |
| 6)    | $$\frac {{\sin^5}{x}+ax} {x+{\cos^5}{x}}$$                   | 10    | 2     | 2.5                | 3.5                |
| 7)    | $$\sqrt[5]{\frac {a+30} {a+\sqrt{ax}}}$$                     | 20    | 4     | 1                  | 10                 |
| 8)    | $$\frac {\ln{(a^2+x^2)}} {\lvert a+x \rvert}$$               | 15    | 2     | 1                  | 5                  |
| 9)    | $${1,5} {\cos^4} {\frac {a+x} {{2a^2}+{2x^2}}}$$             | 10    | 1.5   | 1                  | 4                  |
| 10)   | $$\frac {\sqrt{a+{\sin{x}}}} {\sqrt[3]{4+{\cos{x}}}}$$       | 15    | 2     | 0                  | 1                  |
| 11)   | $$\frac {\ln{(x^4-a^2)}} {a^4+28}$$                          | 18    | 1.5   | 2                  | 3.5                |
```

Человекочитаемый вид: https://github.com/kramenob/astu-boap-sem-ii/blob/main/docs/labs/10/task-statement.md

)";
		} else if (key == "methods") {
			cout << R"(
Способы решения:

 1. Цикл с предусловием (`while ( ... ) { ... };`)
 2. Цикл с постусловием (`do { ... } while ( ... );`)
 3. Цикл с параметром   (`for ( ... ) { ... };`)

)";
		}

		return;
	}

}
